export const CLASS_TABLE_TYPE = {
  TOPIK_READING: [
    {
      key: '수업 요일과 시간',
      value: '월, 목 오후 7:00~8:50 (8회, 16시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 능력 시험을 준비하는 중,고급 학습자',
    },
    {
      key: '수업 내용',
      value: '토픽 시험 준비를 위한 단어 연습과 한국어 읽기 시험 연습',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '한국어 능력 시험 기출 / 2K 부교재',
    },
  ],

  TOPIK_LISTENING: [
    {
      key: '수업 요일과 시간',
      value: '화, 금  오후 7:00~8:50 (8회, 16시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 능력 시험을 준비하는 중,고급 학습자',
    },
    {
      key: '수업 내용',
      value: '토픽 시험 준비를 위한 단어 연습과 한국어 듣기 시험 연습',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '한국어 능력 시험 기출 / 2K 부교재',
    },
  ],
  TOPIK_WRITING: [
    {
      key: '수업 요일과 시간',
      value: '수, 토  오후 7:00~8:50 (8회, 16시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 능력 시험을 준비하는 중,고급 학습자',
    },
    {
      key: '수업 내용',
      value: '토픽 시험 준비를 위한 문법 연습과 한국어 쓰기 시험 연습',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '한국어 능력 시험 기출 / 2K 부교재',
    },
  ],

  SPEAKING_BASIC: [
    {
      key: '수업 요일과 시간',
      value: '월, 목  오후 6:00~7:30 (8회, 12시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 1급 학습자',
    },
    {
      key: '수업 내용',
      value:
        '단문 중심의 한국어 말하기 연습( 숫자 표현, 시간 표현, 기초 생존 한국어 )',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '2K 자체 제작',
    },
  ],

  SPEAKING_INTERMEDIATE: [
    {
      key: '수업 요일과 시간',
      value: '화, 금  오후 6:00~7:30 (8회, 12시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 2~3급 학습자',
    },
    {
      key: '수업 내용',
      value:
        '생활 환경 중심의 한국어 말하기 연습( 관형절 연습, 간접 화법 연습, 한국어 유창성 연습 )',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '2K 자체 제작',
    },
  ],

  SPEAKING_EXPERT: [
    {
      key: '수업 요일과 시간',
      value: '수, 토  오후 6:00~6:50 (8회, 8시간)',
    },
    {
      key: '수업 대상',
      value: '한국어 4~6급 학습자',
    },
    {
      key: '수업 내용',
      value: '발표와 토론 중심의 한국어 말하기 연습( 발표 연습, 토론 연습  )',
    },
    {
      key: '학생 수',
      value: '10명 이하',
    },
    {
      key: '수업료',
      value: '1개월 260,000원',
    },
    {
      key: '교재',
      value: '연세한국어 6급',
    },
  ],
};
